vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA186_DFP.pdsc
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.glikey.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.i3c, device=MCXA186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=MCXA186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpc_freqme.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpi2c, driver.edma4, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpi2c, driver.edma4, device=MCXA186.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpspi, driver.edma4, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpspi, driver.edma4, device=MCXA186.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpuart, driver.edma4, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpuart, driver.edma4, device=MCXA186.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.mcx_cmc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.mcx_spc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.mcx_vbat.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA186.internal_condition"/>
    </condition>
